# task0.
# Напишіть скрипт, який обчислює площу прямокутника a*b, площу трикутника 0.5*h*a, 
# площу кола pi*r**2 і цей скрипт використати в іншому модулі, в якому ми запитуємо користувача площу якої фігури він хоче обчислити. 
# (для виконання завдання необхідно імпортувати  модуль math, а з нього функцію pow() та значення змінної пі, модуль1, 
# який містить три функції для знаходження площ, модуль2, в якому імпортований модуль1 і виконується основна логіка програми).

import math

def Rectangle(a,b):
    
    s = a * b
    return s

def Triangle(h,a):
    s = 0.5 * h * a
    return s

def Circle(r):
    s = math.pi * r.pow(2)
    return s