#є три види модулів

#1. STL-standart library

#це вбудовані модулі в Python,
#наприклад 

# import datetime
# print(datetime.datetime.now())
#################################

#2. написані власноруч
#################################3

# 3.скачані з репозиторію PyPi

###################
#імпортуємо весь 
# модуль math
########################
#import math
########################
#  Використовуємо функцію 
# sqrt з модуля math

# import math
# print (math.sqrt(9))

# значення змінної pi, 
# яка визначена в math
#після імпортування модуля
#його назва стає змінною
#через яку можна отримати 
#доступ до атрибутів модуля

# import math
# print (math.pi)

#######################
#підключення модуля
#для отримання поточної
#директорії
###################

# import os
# print(os.getcwd())

#bad practies
#підключення декількох 
# модулів за одним разом
#######################
# import time, random

# print(time.time())

# print(random.random())
########################
#Варто зауважити, 
# що якщо вказаний атрибут 
# модуля не буде знайдений, 
# то виникне 
# exception AttributeError. 
# А якщо не знайдеться
#  модуль для імпортування, 
# то ImportError.

#import notexist #  ModuleNotFoundError

###########################

# import math
# print(math.ty(25)) # AttributeError

###########################
#використання псевдонімів

# import math as m
# print(m.e)

##############################
#Команда from ... import 
# дозволяє імпортувати 
# не весь модуль 
# повністю, а тільки певний
# його вміст
###############################
# Імпортуємо з модуля 
# math функцію sqrt
##############################
# Виводимо результат 
#виконання функції sqrt.
# Зверніть увагу, що 
# нам більше не має 
# потреби вказувати
# імя модуля

# from math import sqrt
# print(sqrt(144))

# Але ми вже не можемо
# отримати з модуля те,
# що не імпортували

# from math import sqrt
# print (pi) # NameError 
##########################
#конструкція from ... import *
#імпортує все (змінні, функції, 
# класи) за один раз з модуля
#############################

#from math import *
# Тепер в нас є доступ 
#до всіх функцій і 
# змінних, які визначені
# в модулі math

# print (sqrt(121))
# print (pi)
# print (e)
#################
# # import random
# from random import choice 
# color_list=["red","white","green","blue","black","pink"]
# # print(random.choice(color_list))
# print(choice(color_list))

###############
#приклад конфліктної ситуації
#ми імпортували всі функції з
#random(в тому числі і функцію 
# choice) і десь по ходу коду
# ми мали визначену власну 
# функцію choice, маємо конфлікт,
# тому з * треба бути обачними
# ####################3 
# from random import *
# # def choice(name):
# #     pass
# color_list=["red","white","green","blue","black","pink"]
# print(choice(color_list)) #AttributeError

